{
     "web1": 
         {
            "levelNum": 1,
            "video": "https://www.youtube.com/embed/salY_Sm6mv4?si=gp5HnFHbtGpDwTus",
            "vidSubtext": "Check out this quick intro to HTML!",
            "courseDescription": "In this course, students will learn and practice HTML, Bootstrap, and CSS, which are foundational tools for building modern, responsive websites. They will gain hands-on experience creating well-structured webpages using HTML, designing visually appealing layouts with CSS, and implementing responsive, mobile-first design principles using Bootstrap. By the end of the course, students will have a solid understanding of front-end web development and be equipped with the skills to create professional, functional websites. The course will also cover best practices in web design and user experience to ensure students can produce clean, user-friendly interfaces.",
            "courseImg": "img/web1websites/htmlcssbs.jpg",
            "teacherImg": "img/msleonard.JPG",
            "teacherDescription": "Web Design 1 is designed to teach sophomore students the skills they would need if they were to pursue a career related to computer science or graphic design. Students are not expected to have any prior knowledge in coding before they take this course. Students are expected to be able to collaborate with peers throughout various projects during the year. Students will learn coding language and frameworks including HTML, CSS, and Bootstrap. Skills in layout and design will also be developed throughout the year, as students will learn how to use basic software such as Adobe Photoshop. Students will work on different project based learning experiences as the year progresses and get a feel for what it would be like to design a web page for a potential future client. - Ms. Leonard",
            "testimonial1": "I loved web 1! I came in with no experience and left with a great understanding of front end design.",
            "testimonial2": "Ms.Leonard is so supportive and such an amazing teacher! She is always so patient and understanding.",
            "testimonial3": "I had no Idea I was interested in web design before taking level 1. I can't wait for the next 2 years in this program.",
            "testimonial4": "I learned so much in level 1 and the skills have served as a foundation all the way through my senior year.",
            "testimonial5": "I made such amazing friends in web 1 and have loved working with everyone these past 3 years.",
            "furtherInfo": "Students will start with HTML and then learn to stylize with CSS. They will then learn bootstrap to help with responsiveness and stylization. The first site is typically a 'Hello World' site and the last is typically a final portfolio."
        }, 
    "web2": 
        {
        "levelNum": 2,
        "video": "https://www.youtube.com/embed/DHjqpvDnNGE?si=2R2IPL9Jd3ChtKVB",
        "vidSubtext": "Check out this quick intro to JavaScript!",
        "courseDescription": "In this course, students will be introduced to the JavaScript language and take a basic approach in the coding language. They will learn the fundamental concepts such as variables, data types, and functions. As the course progresses, students will explore more advanced topics like loops, conditionals, and object manipulation. By the end, they will have developed the skills needed to build simple interactive websites and applications.",
        "courseImg": "img/web2websites/gallery.png",
        "teacherImg": "img/mrkilgore.JPG",
        "teacherDescription": "Web Design 2 is designed to take students into their second year of their coding experiences. Having just learned HTML, CSS, and Bootstrap, and more importantly web design, Web 2 offers students the ability to learn how to make their webpages interactive. We use JavaScript to do this. JavaScript is the language that lets code be interactive. In order to learn how to use JavaScript, students in Web Design also have to learn how to think like a programmer so it involves a lot of learning programmatic structures, sequence selection of repetition, but abstraction is how to create algorithms and functions. All skills can relate to various aspects of computer science, but they are taught through the design lens. - Mr Kilgore",
        "testimonial1": "Web Design II was a great course, I learned a lot of JavaScript that helped to enchance my website skills!",
        "testimonial2": "Web Design II was amazing, I loved the course, the teacher, my classmates, and the material we learned. It was a great introductory course to Javascript, which help enhance my websites.",
        "testimonial3": "Web 2 is a relaxed class where you learn the basics of JavaScript and master HTML and CSS, very fun and good environment.",
        "testimonial4": "Web Design level 2 is a great course to advance any coding experiences. Along with developing web design skills, the introductory of JavaScript revolutionizes websites and create elite coding skills for any background.",
        "testimonial5": "Web 2 is so goated, I love Mr. Kilgore, he's my goat, he's so humble.",
        "furtherInfo": "Students will create a website every month, with each website introducing a new skill. Throughout the gallery, you could see 6 of the 9 sites that were created throughout the school year. Some taught loops, some taught objects, and others taught other necessary skills to learn the fundamentals of JavaScript." 
        },
    "web3": 
        {
        "levelNum": 3,
        "video": "https://www.youtube.com/embed/JjIvF0yikGU?si=AaTrYOqfRbgTQEJo",
        "vidSubtext": "Check out this quick intro to jQuery!",
        "courseDescription": "The NJIT Web Design Program is the third and final of Marlboro’s Web Design Pathway Program. The course uses what has already been taught, along with javascript libraries including jQuery and Vue to create fully functional websites with the intention that they will be published and used by the general public. Students will be introduced to jQuery and Vue to help advance their knowledge of javascript. " ,
        "courseImg": "img/web3websites/web3.jpg",
        "teacherImg": "img/mrkilgore.JPG",
        "teacherDescription": "Web Design Level 3 is designed to be the culmination of the design program, taking students' knowledge in HTML, CSS, and Bootstrap from Level 1, and combining it with their knowledge and recent experticse in JavaScript and website interactivity. Students then take both of these skill paths and combine them to create functional 'real world' websites. Senior year revolves around four main projects, two of which come from NJIT and involve the application of JavaScript frameworks jQuery and Vue.js. One of the other two is a senior portfolio, which encompasses virtual recordkeeping of all work done by students during the time in the program. The final project in level 3 is a student center learning project where students explore the complete process of website design and development through an in class internship where they will go and find a real world client and then identify, design, and build a functioning website for their client. This will be based on their discussions, recommendations, and research with that client. - Mr. Kilgore",
        "testimonial1": "Web Design Level 3 is an excellent way to advance your web development skills. This course not only enhances your design capabilities but also deepens your JavaScript knowledge, helping you create more immersive digital experiences.",
        "testimonial2": "Web Design Level 3 dives deeper into modern web development, introducing jQuery and Vue to enhance JavaScript’s power. This course is essential for anyone looking to create sleek, responsive, and efficient websites.",
        "testimonial3": "Web Design Level 3 is an exciting step forward in mastering web design.",
        "testimonial4": "Web Design Level 3 doesn’t just teach code—it teaches creativity. With JavaScript, jQuery, and Vue, you’ll craft engaging, interactive experiences that stand out on the web.",
        "testimonial5": "Web Design Level 3 is a great culmination of what I have learned over the past 3 years. Being able to create not just functional websites, but also good-looking websites is probably the one thing I’ve been wanting the most out of this entire program.",
        "furtherInfo": "The course consists of five projects, two of which are found in NJIT’s web development course. The other three projects are the culmination of the three year course in which students will use all of their knowledge to create the most successful websites made in the entire program. The seniors of the program are also entitled to multiple events such as a trip to the Liberty Science Center and Senior Portfolio Night."
        }
    
  
}